Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.vm.agent.waiting
source: Waiting for %1$@ to finish (Ctrl-C stops waiting; the agent keeps running — %2$@).
ar: في انتظار انتهاء %1$@ (يؤدي Ctrl-C إلى إيقاف الانتظار؛ ويستمر الوكيل في التشغيل — %2$@).
de: Warten auf das Beenden von %1$@ (Ctrl-C bricht das Warten ab; der Agent läuft weiter — %2$@).
es: Esperando a que %1$@ finalice (Ctrl-C detiene la espera; el agente sigue ejecutándose — %2$@).
fr: En attente de la fin de %1$@ (Ctrl-C arrête l'attente ; l'agent continue de s'exécuter — %2$@).
ja: %1$@ の終了を待っています（Ctrl-C は待機だけを止め、エージェントは実行を続けます — %2$@）。
ko: %1$@이(가) 완료되기를 기다리는 중 (Ctrl-C를 누르면 대기를 중단하지만, 에이전트는 계속 실행됩니다 — %2$@).
zh_hans: 正在等待 %1$@ 完成（Ctrl-C 停止等待；代理将继续运行 — %2$@）。
zh_hant: 正在等待 %1$@ 結束 (Ctrl-C 停止等待；代理程式會繼續執行 — %2$@)。

# cli.vm.env.lsUnknownFlag
source: vm env ls: unknown flag '%1$@' %2$@
ar: vm env ls: علامة غير معروفة '%1$@' %2$@
de: vm env ls: unbekanntes Flag '%1$@' %2$@
es: vm env ls: bandera desconocida '%1$@' %2$@
fr: vm env ls : option inconnue '%1$@' %2$@
ja: vm env ls: 不明なフラグ '%1$@' %2$@
ko: vm env ls: 알 수 없는 플래그 '%1$@' %2$@
zh_hans: vm env ls: 未知标志 '%1$@' %2$@
zh_hant: vm env ls: 未知旗標 '%1$@' %2$@

# cli.vm.env.remove.many
source: OK removed %1$ld variables on %2$@: %3$@
ar: تمت إزالة %1$ld متغير على %2$@: %3$@
de: OK, %1$ld Variablen auf %2$@ entfernt: %3$@
es: OK, se eliminaron %1$ld variables en %2$@: %3$@
fr: OK, %1$ld variables supprimées sur %2$@ : %3$@
ja: %1$ld 個の変数を %2$@ から削除しました: %3$@
ko: %1$ld개 변수를 %2$@에서 삭제했습니다: %3$@
zh_hans: 已移除 %1$ld 个变量（%2$@）：%3$@
zh_hant: 已移除 %1$ld 個變數（%2$@）：%3$@

# cli.vm.env.remove.one
source: OK removed %1$ld variable on %2$@: %3$@
ar: تمت إزالة %1$ld متغير على %2$@: %3$@
de: OK, %1$ld Variablen auf %2$@ entfernt: %3$@
es: OK, se eliminaron %1$ld variables en %2$@: %3$@
fr: OK, %1$ld variables supprimées sur %2$@ : %3$@
ja: %1$ld 個の変数を %2$@ から削除しました: %3$@
ko: %1$ld개 변수를 %2$@에서 삭제했습니다: %3$@
zh_hans: 已移除 %1$ld 个变量（%2$@）：%3$@
zh_hant: 已移除 %1$ld 個變數（%2$@）：%3$@

# cli.vm.env.rmGiveAtLeastOneKEY
source: vm env rm: give at least one KEY %1$@
ar: vm env rm: حدد مفتاح KEY واحدًا على الأقل %1$@
de: vm env rm: Geben Sie mindestens einen KEY an %1$@
es: vm env rm: proporcione al menos una KEY %1$@
fr: vm env rm : fournissez au moins une variable KEY %1$@
ja: vm env rm: 少なくとも1つのKEYを指定してください %1$@
ko: vm env rm: 최소 하나의 KEY를 지정해야 합니다 %1$@
zh_hans: vm env rm: 请指定至少一个 KEY %1$@
zh_hant: vm env rm: 請提供至少一個 KEY %1$@

# cli.vm.env.rmInvalidVariableNameKeysMatchA
source: vm env rm: invalid variable name '%1$@' (keys match [A-Za-z_][A-Za-z0-9_]*)
ar: vm env rm: اسم متغير غير صالح '%1$@' (تطابق المفاتيح [A-Za-z_][A-Za-z0-9_]*)
de: vm env rm: ungültiger Variablenname '%1$@' (Schlüssel müssen mit [A-Za-z_][A-Za-z0-9_]* übereinstimmen)
es: vm env rm: nombre de variable no válido '%1$@' (las claves coinciden con [A-Za-z_][A-Za-z0-9_]*)
fr: vm env rm : nom de variable non valide '%1$@' (les clés doivent correspondre à [A-Za-z_][A-Za-z0-9_]*)
ja: vm env rm: 無効な変数名 '%1$@' (キーは [A-Za-z_][A-Za-z0-9_]* に一致する必要があります)
ko: vm env rm: 잘못된 변수 이름 '%1$@' (키는 [A-Za-z_][A-Za-z0-9_]* 패턴과 일치해야 합니다)
zh_hans: vm env rm: 变量名 '%1$@' 无效（键必须匹配 [A-Za-z_][A-Za-z0-9_]*）
zh_hant: vm env rm: 無效的變數名稱 '%1$@' (鍵值需符合 [A-Za-z_][A-Za-z0-9_]*)

# cli.vm.env.rmUnknownFlag
source: vm env rm: unknown flag '%1$@' %2$@
ar: vm env rm: علامة غير معروفة '%1$@' %2$@
de: vm env rm: unbekanntes Flag '%1$@' %2$@
es: vm env rm: bandera desconocida '%1$@' %2$@
fr: vm env rm : option inconnue '%1$@' %2$@
ja: vm env rm: 不明なフラグ '%1$@' %2$@
ko: vm env rm: 알 수 없는 플래그 '%1$@' %2$@
zh_hans: vm env rm: 未知标志 '%1$@' %2$@
zh_hant: vm env rm: 未知旗標 '%1$@' %2$@

# cli.vm.env.set.many
source: OK set %1$ld variables on %2$@: %3$@
ar: تم ضبط %1$ld متغير على %2$@: %3$@
de: OK, %1$ld Variablen auf %2$@ gesetzt: %3$@
es: OK, se establecieron %1$ld variables en %2$@: %3$@
fr: OK, %1$ld variables définies sur %2$@ : %3$@
ja: %1$ld 個の変数を %2$@ に設定しました: %3$@
ko: %1$ld개 변수를 %2$@에 설정했습니다: %3$@
zh_hans: 已设置 %1$ld 个变量（%2$@）：%3$@
zh_hant: 已設定 %1$ld 個變數（%2$@）：%3$@

# cli.vm.env.set.one
source: OK set %1$ld variable on %2$@: %3$@
ar: تم ضبط %1$ld متغير على %2$@: %3$@
de: OK, %1$ld Variablen auf %2$@ gesetzt: %3$@
es: OK, se establecieron %1$ld variables en %2$@: %3$@
fr: OK, %1$ld variables définies sur %2$@ : %3$@
ja: %1$ld 個の変数を %2$@ に設定しました: %3$@
ko: %1$ld개 변수를 %2$@에 설정했습니다: %3$@
zh_hans: 已设置 %1$ld 个变量（%2$@）：%3$@
zh_hant: 已設定 %1$ld 個變數（%2$@）：%3$@

# cli.vm.env.setCannotRead
source: vm env set: cannot read %1$@
ar: vm env set: تعذر قراءة %1$@
de: vm env set: %1$@ kann nicht gelesen werden
es: vm env set: no se puede leer %1$@
fr: vm env set : impossible de lire %1$@
ja: vm env set: %1$@を読み込めません
ko: vm env set: %1$@을(를) 읽을 수 없습니다
zh_hans: vm env set: 无法读取 %1$@
zh_hant: vm env set: 無法讀取 %1$@

# cli.vm.env.setEveryEntryNeedsAStringKeyAnd
source: vm.env_set: every entry needs a string `key` and a string `value`.
ar: vm.env_set: يحتاج كل إدخال إلى `key` نصي و`value` نصية.
de: vm.env_set: Jeder Eintrag benötigt einen String `key` und einen String `value`.
es: vm.env_set: cada entrada necesita una cadena `key` y una cadena `value`.
fr: vm.env_set : chaque entrée nécessite une clé `key` de type chaîne de caractères et une valeur `value` de type chaîne de caractères.
ja: vm.env_set: すべてのエントリに文字列の `key` と文字列の `value` が必要です。
ko: vm.env_set: 모든 항목에는 문자열 `key`와 문자열 `value`가 필요합니다.
zh_hans: vm.env_set：每个条目都需要一个字符串 `key` 和一个字符串 `value`。
zh_hant: vm.env_set：每個項目都需要字串 `key` 與字串 `value`。

# cli.vm.env.setGiveKEYVALUEPairsFromFileEnv
source: vm env set: give KEY=VALUE pairs, --from-file <.env>, or - for stdin %1$@
ar: vm env set: قدم أزواج KEY=VALUE، أو --from-file <.env>، أو - للإدخال القياسي stdin %1$@
de: vm env set: Geben Sie KEY=VALUE-Paare, --from-file <.env> oder - für stdin an %1$@
es: vm env set: proporcione pares KEY=VALUE, --from-file <.env> o - para stdin %1$@
fr: vm env set : fournissez des paires KEY=VALUE, --from-file <.env>, ou - pour l'entrée standard (stdin) %1$@
ja: vm env set: KEY=VALUEのペア、--from-file <.env>、または標準入力用の - を指定してください %1$@
ko: vm env set: KEY=VALUE 쌍, --from-file <.env> 또는 stdin을 위해 -을 제공하십시오 %1$@
zh_hans: vm env set：提供 KEY=VALUE 键值对、--from-file <.env>，或通过 - 表示标准输入 %1$@
zh_hant: vm env set：提供 KEY=VALUE 鍵值對、--from-file <.env>，或用 - 表示標準輸入 (stdin) %1$@

# cli.vm.env.setInvalidVariableNameKeysMatchA
source: vm.env_set: invalid variable name '%1$@' (keys match [A-Za-z_][A-Za-z0-9_]*).
ar: vm.env_set: اسم متغير غير صالح '%1$@' (تطابق المفاتيح [A-Za-z_][A-Za-z0-9_]*).
de: vm.env_set: ungültiger Variablenname '%1$@' (Schlüssel müssen mit [A-Za-z_][A-Za-z0-9_]* übereinstimmen).
es: vm.env_set: nombre de variable no válido '%1$@' (las claves coinciden con [A-Za-z_][A-Za-z0-9_]*).
fr: vm.env_set : nom de variable non valide '%1$@' (les clés doivent correspondre à [A-Za-z_][A-Za-z0-9_]*).
ja: vm.env_set: 無効な変数名 '%1$@' (キーは [A-Za-z_][A-Za-z0-9_]* に一致する必要があります)。
ko: vm.env_set: 유효하지 않은 변수 이름 '%1$@' (키는 [A-Za-z_][A-Za-z0-9_]* 패턴과 일치해야 합니다).
zh_hans: vm.env_set：无效的变量名 '%1$@'（键必须匹配 [A-Za-z_][A-Za-z0-9_]*）。
zh_hant: vm.env_set：無效的變數名稱 '%1$@'（鍵名須符合 [A-Za-z_][A-Za-z0-9_]*）。

# cli.vm.env.setRequiresEntriesANonEmptyArrayOf
source: vm.env_set requires `entries`: a non-empty array of {key, value}.
ar: يتطلب vm.env_set حقل `entries`: مصفوفة غير فارغة من {key, value}.
de: vm.env_set erfordert `entries`: ein nicht leeres Array von {key, value}.
es: vm.env_set requiere `entries`: un arreglo no vacío de {key, value}.
fr: vm.env_set requiert `entries` : un tableau non vide d'éléments {key, value}.
ja: vm.env_set には `entries`（{key, value} の空でない配列）が必要です。
ko: vm.env_set에는 `entries`가 필요합니다: 비어 있지 않은 {key, value} 배열이어야 합니다.
zh_hans: vm.env_set 需要 `entries`：一个由 {key, value} 组成的非空数组。
zh_hant: vm.env_set 需要 `entries`：由 {key, value} 組成的非空陣列。

# cli.vm.env.setRequiresIdRunCmuxVmLsTo
source: vm.env_set requires `id`. Run `cmux vm ls` to find one.
ar: يتطلب vm.env_set حقل `id`. قم بتشغيل `cmux vm ls` للعثور على واحد.
de: vm.env_set erfordert `id`. Führen Sie `cmux vm ls` aus, um eine zu finden.
es: vm.env_set requiere `id`. Ejecute `cmux vm ls` para encontrar uno.
fr: vm.env_set requiert `id`. Exécutez `cmux vm ls` pour en trouver un.
ja: vm.env_set には `id` が必要です。取得するには `cmux vm ls` を実行してください。
ko: vm.env_set에는 `id`가 필요합니다. 이를 찾으려면 `cmux vm ls`를 실행하십시오.
zh_hans: vm.env_set 需要 `id`。运行 `cmux vm ls` 以查找一个。
zh_hant: vm.env_set 需要 `id`。請執行 `cmux vm ls` 來尋找。

# cli.vm.env.setUnknownFlag
source: vm env set: unknown flag '%1$@' %2$@
ar: vm env set: علامة غير معروفة '%1$@' %2$@
de: vm env set: unbekanntes Flag '%1$@' %2$@
es: vm env set: bandera desconocida '%1$@' %2$@
fr: vm env set : option inconnue '%1$@' %2$@
ja: vm env set: 不明なフラグ '%1$@' %2$@
ko: vm env set: 알 수 없는 플래그 '%1$@' %2$@
zh_hans: vm env set：未知标志 '%1$@' %2$@
zh_hant: vm env set：未知的旗標 '%1$@' %2$@

# cli.vm.env.unknownVerb
source: vm env: unknown verb '%1$@' %2$@
ar: vm env: فعل غير معروف '%1$@' %2$@
de: vm env: unbekanntes Verb '%1$@' %2$@
es: vm env: verbo desconocido '%1$@' %2$@
fr: vm env : verbe inconnu '%1$@' %2$@
ja: vm env: 不明な操作 '%1$@' %2$@
ko: vm env: 알 수 없는 verb '%1$@' %2$@
zh_hans: vm env：未知子命令 '%1$@' %2$@
zh_hant: vm env：未知的動詞 '%1$@' %2$@

# cli.vm.env.usage
source: Usage: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] Set environment variables for every terminal, agent, and command cmux starts on the machine. They persist in ~/.config/cmux/env on its durable volume (mode 0600) and are sourced by login and interactive shells there. --from-file and `-` (stdin) read KEY=VALUE lines (dotenv rules: blank lines and # comments skipped, optional `export `, matching quotes stripped) — prefer them over KEY=VALUE on the command line so values stay out of your shell history and `ps`. cmux vm env ls <machine> [--show] List the variable names; --show prints the values too. cmux vm env rm <machine> KEY [KEY2 …] Remove variables. How values travel: over the machine's cmux-tui link (end-to-end encrypted, brokered but never read by the control plane) into the machine's `cmux env receive`, which turns terminal echo off before it reads. Nothing passes through vm.exec, a command line, or a terminal's screen, and only names are ever printed back (use --show to see values). Forks, snapshots, and templates of the machine inherit the file; `cmux vm env rm` before you promote one. Keys match [A-Za-z_][A-Za-z0-9_]*. Add --json for the raw result.
ar: الاستخدام: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] تعيين متغيرات البيئة لكل طرفية، ووكيل، و أمر يبدأ تشغيله cmux على الجهاز. وتُحفظ في `~/.config/cmux/env` على وحدة التخزين المستديمة الخاصة به (الوضع 0600) ويتم قراءتها وتطبيقها بواسطة قشور تسجيل الدخول والقشور التفاعلية هناك. ويقوم --from-file و `-` (stdin) بقراءة أسطر KEY=VALUE (قواعد dotenv: الأسطر الفارغة وتعليقات # يتم تخطيها، و `export ` اختيارية، وعلامات الاقتباس المتطابقة تُزال) — ويُفضل استخدامها على KEY=VALUE في سطر الأوامر حتى تظل القيم خارج سجل الغلاف الخاص بك و `ps`. cmux vm env ls <machine> [--show] عرض قائمة بأسماء المتغيرات؛ ويقوم --show بطباعة القيم أيضًا. cmux vm env rm <machine> KEY [KEY2 …] إزالة المتغيرات. طريقة انتقال القيم: عبر رابط cmux-tui الخاص بالجهاز (مُشفر من الطرف إلى الطرف، يتم بواسطة وسيط ولكن لا يُقرأ أبدًا من قِبل مستوى التحكم) إلى داخل `cmux env receive` الخاص بالجهاز، والذي يوقف صدى الطرفية قبل أن يقرأ. لا يمر شيء عبر vm.exec، أو سطر الأوامر، أو شاشة الطرفية، ولا تُطبع سوى الأسماء فقط مجددًا (استخدم --show لرؤية القيم). التفرعات، واللقطات، و قوالب الجهاز ترث هذا الملف؛ نفّذ `cmux vm env rm` قبل ترقية أي منها. تطابق المفاتيح النمط [A-Za-z_][A-Za-z0-9_]*. أضف --json للحصول على النتيجة الخام.
de: Verwendung: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] Umgebungsvariablen für jedes Terminal, jeden Agenten und jeden Befehl festlegen, den cmux auf der Maschine startet. Sie bleiben in ~/.config/cmux/env auf dem dauerhaften Volume (Modus 0600) erhalten und werden dort von Login- und interaktiven Shells eingelesen. --from-file und `-` (stdin) lesen KEY=VALUE-Zeilen (dotenv-Regeln: leere Zeilen und #-Kommentare werden übersprungen, optionales `export `, übereinstimmende Anführungszeichen werden entfernt) — bevorzugen Sie diese gegenüber KEY=VALUE auf der Befehlszeile, damit Werte nicht in Ihrem Shell-Verlauf und `ps` erscheinen. cmux vm env ls <machine> [--show] Listen Sie die Variablennamen auf; --show gibt auch die Werte aus. cmux vm env rm <machine> KEY [KEY2 …] Variablen entfernen. Wie Werte übertragen werden: über die cmux-tui-Verbindung der Maschine (Ende-zu-Ende verschlüsselt, vermittelt, aber nie von der Control Plane gelesen) in das `cmux env receive` der Maschine, das das Terminal-Echo ausschaltet, bevor es liest. Nichts läuft über vm.exec, eine Befehlszeile oder den Bildschirm eines Terminals, und nur Namen werden jemals ausgegeben (verwenden Sie --show, um Werte anzuzeigen). Forks, Snapshots und Vorlagen der Maschine erben die Datei; führen Sie `cmux vm env rm` aus, bevor Sie eine hochstufen. Schlüssel entsprechen [A-Za-z_][A-Za-z0-9_]*. Fügen Sie --json für das rohe Ergebnis hinzu.
es: Uso: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] Establece las variables de entorno para cada terminal, agente y comando que cmux inicia en la máquina. Persisten en ~/.config/cmux/env en su volumen duradero (modo 0600) y son cargadas por los shells de inicio de sesión e interactivos allí. --from-file y `-` (stdin) leen líneas KEY=VALUE (reglas de dotenv: líneas en blanco y comentarios que comienzan con # se omiten, `export ` opcional, comillas coincidentes eliminadas) — es preferible usarlas en lugar de KEY=VALUE en la línea de comandos para que los valores queden fuera de su historial de shell y de `ps`. cmux vm env ls <machine> [--show] Muestra la lista de nombres de variables; --show también imprime los valores. cmux vm env rm <machine> KEY [KEY2 …] Elimina variables. Cómo viajan los valores: a través del enlace cmux-tui de la máquina (cifrado de extremo a extremo, gestionado pero nunca leído por el plano de control) hacia el comando `cmux env receive` de la máquina, que desactiva el eco de la terminal antes de leer. Nada pasa a través de vm.exec, una línea de comandos o la pantalla de una terminal, y solo se vuelven a imprimir los nombres (use --show para ver los valores). Las bifurcaciones, instantáneas y plantillas de la máquina heredan el archivo; ejecute `cmux vm env rm` antes de promocionar una. Las claves coinciden con [A-Za-z_][A-Za-z0-9_]*. Añada --json para obtener el resultado sin procesar.
fr: Utilisation : cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] Définir des variables d'environnement pour chaque terminal, agent et commande démarrée par cmux sur la machine. Elles persistent dans ~/.config/cmux/env sur son volume durable (mode 0600) et sont chargées par les shells de connexion et interactifs à cet endroit. --from-file et `-` (stdin) lisent des lignes KEY=VALUE (règles dotenv : lignes vides et commentaires # ignorés, `export ` optionnel, guillemets correspondants supprimés) — préférez-les à KEY=VALUE sur la ligne de commande afin que les valeurs n'apparaissent pas dans l'historique de votre shell et `ps`. cmux vm env ls <machine> [--show] Lister les noms des variables ; --show affiche également les valeurs. cmux vm env rm <machine> KEY [KEY2 …] Supprimer les variables. Comment transitent les valeurs : via la liaison cmux-tui de la machine (chiffrée de bout en bout, relayée mais jamais lue par le plan de contrôle) vers le `cmux env receive` de la machine, qui désactive l'écho du terminal avant de lire. Rien ne passe par vm.exec, une ligne de commande ou l'écran d'un terminal, et seuls les noms sont réaffichés (utilisez --show pour voir les valeurs). Les forks, snapshots et modèles de la machine héritent du fichier ; `cmux vm env rm` avant d'en promouvoir un. Les clés correspondent à [A-Za-z_][A-Za-z0-9_]*. Ajoutez --json pour obtenir le résultat brut.
ja: 使用法: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] マシン上で cmux が起動するすべてのターミナル、エージェント、および コマンドに環境変数を設定します。これらは、その永続ボリューム（モード 0600）の ~/.config/cmux/env に保存され、 そこでログインシェルおよびインタラクティブシェルによって読み込まれます。--from-file および `-` (標準入力) は KEY=VALUE 形式の行を読み込みます (dotenv ルール: 空行 および # コメントはスキップされ、オプションの `export ` や、対応する クォーテーションは削除されます) — 値がシェルの履歴や `ps` に残らないよう、コマンドライン上での KEY=VALUE の指定よりもこちらを推奨します。 cmux vm env ls <machine> [--show] 変数名の一覧を表示します。--show は値も出力します。 cmux vm env rm <machine> KEY [KEY2 …] 変数を削除します。 値の伝送経路: マシンの cmux-tui リンク (エンドツーエンドで暗号化され、仲介されますがコントロールプレーンに 読み取られることはありません) を介してマシンの `cmux env receive` に送られ、読み込み前にターミナルのエコーが オフになります。vm.exec、コマンドライン、またはターミナルの画面を通過するものはなく、 返されるのは名前のみです (値を確認するには --show を使用してください)。マシンのフォーク、スナップショット、および テンプレートはこのファイルを継承します。プロモートする前に `cmux vm env rm` を実行してください。 キーは [A-Za-z_][A-Za-z0-9_]* に一致する必要があります。生の結果を取得するには --json を追加してください。
ko: 사용법: cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] 머신에서 cmux가 시작하는 모든 터미널, 에이전트 및 명령에 대한 환경 변수를 설정합니다. 이 변수들은 해당 머신의 지속성 볼륨의 ~/.config/cmux/env (모드 0600)에 영구 보존되며, 그곳의 로그인 및 대화형 셸에서 소스(source)됩니다. --from-file 및 `-` (stdin)은 KEY=VALUE 라인을 읽습니다 (dotenv 규칙: 빈 라인 및 # 주석 건너뜀, 선택 사항인 `export `, 일치하는 따옴표 제거) — 값이 셸 기록 및 `ps`에 남지 않도록 명령줄의 KEY=VALUE 대신 이 방법을 사용하는 것을 권장합니다. cmux vm env ls <machine> [--show] 변수 이름을 나열합니다. --show는 값도 함께 출력합니다. cmux vm env rm <machine> KEY [KEY2 …] 변수를 제거합니다. 값이 전달되는 경로: 머신의 cmux-tui 링크(종단간 암호화됨, 제어 평면이 중개하지만 절대 읽지 않음)를 통해 머신의 `cmux env receive`로 전달되며, 이는 읽기 전에 터미널 에코를 끕니다. vm.exec, 명령줄 또는 터미널 화면을 통해서는 아무것도 전달되지 않으며, 오직 이름만 다시 출력됩니다 (값을 보려면 --show를 사용하세요). 머신의 포크, 스냅샷 및 템플릿은 이 파일을 상속하므로, 승격(promote)하기 전에 `cmux vm env rm`을 실행하십시오. 키는 [A-Za-z_][A-Za-z0-9_]* 패턴과 일치해야 합니다. 원시 결과를 얻으려면 --json을 추가하십시오.
zh_hans: 用法： cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] 为该机器上启动的每个终端、代理以及 cmux 命令设置环境变量。它们会持久保存在 ~/.config/cmux/env 中（在其持久卷上，模式为 0600），并由 那里的登录和交互式 shell 加载。--from-file 和 `-`（stdin）读取 KEY=VALUE 行（dotenv 规则：跳过空白 行和 # 注释，可选的 `export `，去除匹配的 引号）—— 建议优先使用它们，而不是在命令行上指定 KEY=VALUE， 这样可以避免值出现在您的 shell 历史记录和 `ps` 中。 cmux vm env ls <machine> [--show] 列出变量名称；--show 也会打印它们的值。 cmux vm env rm <machine> KEY [KEY2 …] 移除变量。 值是如何传输的：通过机器的 cmux-tui 链接（端到端加密，中转但绝不 会被控制面读取）进入机器的 `cmux env receive`，它会在读取前关闭终端回显 。没有任何内容会通过 vm.exec、命令行或终端屏幕， 且只会将变量名打印回来（使用 --show 查看值）。该机器的分支、快照和 模板会继承该文件；在提升其中一个之前，请运行 `cmux vm env rm`。 键名需匹配 [A-Za-z_][A-Za-z0-9_]*。添加 --json 以获取原始结果。
zh_hant: 用法： cmux vm env set <machine> KEY=VALUE [KEY2=VALUE2 …] [--from-file <.env>] [-] 為 cmux 在此機器上啟動的每個終端機、代理和 命令設定環境變數。它們會持久儲存在 ~/.config/cmux/env（位於其持久性磁碟區，模式為 0600），並會 在那裡的登入和互動式 shell 中載入。--from-file 和 `-` (stdin) 會讀取 KEY=VALUE 行（dotenv 規則：空白 行與 # 註解會被跳過、選用的 `export `、成對的 引號會被剝離）— 建議優先使用此方式，而非在命令 列上使用 KEY=VALUE，以免值留在您的 shell 歷史紀錄和 `ps` 中。 cmux vm env ls <machine> [--show] 列出變數名稱；--show 也會列印出其值。 cmux vm env rm <machine> KEY [KEY2 …] 移除變數。 數值傳輸方式：透過機器的 cmux-tui 連結（端到端加密，經中介但絕不 被控制平面讀取）進入機器的 `cmux env receive`，其會關閉終端機的回應 沒有任何內容會通過 vm.exec、命令列或終端機的畫面， 且只有名稱會被印回（使用 --show 來查看值）。機器的分叉、快照及 範本會繼承此檔案；在將其升級（promote）之前，請先執行 `cmux vm env rm`。 鍵值符合 [A-Za-z_][A-Za-z0-9_]*。加入 --json 來取得原始結果。

# cli.vm.layout.applyCannotRead
source: vm layout apply: cannot read %1$@
ar: vm layout apply: لا يمكن قراءة %1$@
de: vm layout apply: %1$@ kann nicht gelesen werden
es: vm layout apply: no se puede leer %1$@
fr: vm layout apply: impossible de lire %1$@
ja: vm layout apply: %1$@ を読み込めません
ko: vm layout apply: %1$@을(를) 읽을 수 없습니다
zh_hans: vm layout apply: 无法读取 %1$@
zh_hant: vm layout apply: 無法讀取 %1$@

# cli.vm.layout.applyEmptyLayoutDocumentOnStdin
source: vm layout apply: empty layout document on stdin
ar: vm layout apply: مستند تخطيط فارغ على stdin
de: vm layout apply: leeres Layout-Dokument in stdin
es: vm layout apply: documento de diseño vacío en stdin
fr: vm layout apply: document de disposition vide sur stdin
ja: vm layout apply: 標準入力のレイアウトドキュメントが空です
ko: vm layout apply: 표준 입력(stdin)의 레이아웃 문서가 비어 있습니다
zh_hans: vm layout apply: stdin 中的布局文档为空
zh_hant: vm layout apply: stdin 上的版面配置文件為空

# cli.vm.layout.applyFromSavedNeedsALayoutNameSee
source: vm layout apply: --from-saved needs a layout name (see `cmux layout list`)
ar: vm layout apply: يتطلب --from-saved اسم تخطيط (انظر `cmux layout list`)
de: vm layout apply: --from-saved benötigt einen Layout-Namen (siehe `cmux layout list`)
es: vm layout apply: --from-saved necesita un nombre de diseño (consulte `cmux layout list`)
fr: vm layout apply: --from-saved requiert un nom de disposition (voir `cmux layout list`)
ja: vm layout apply: --from-saved にはレイアウト名が必要です（`cmux layout list` を参照）
ko: vm layout apply: --from-saved 옵션에는 레이아웃 이름이 필요합니다 (`cmux layout list` 참고)
zh_hans: vm layout apply: --from-saved 需要一个布局名称（参见 `cmux layout list`）
zh_hant: vm layout apply: --from-saved 需要版面配置名稱 (請參閱 `cmux layout list`)

# cli.vm.layout.applyGiveALayoutFileForStdinOr
source: vm layout apply: give a layout file, `-` for stdin, or --from-saved <name> %1$@
ar: vm layout apply: حدد ملف تخطيط، أو `-` لـ stdin، أو --from-saved <name> %1$@
de: vm layout apply: Geben Sie eine Layout-Datei, `-` für stdin oder --from-saved <name> an %1$@
es: vm layout apply: proporcione un archivo de diseño, `-` para stdin, o --from-saved <nombre> %1$@
fr: vm layout apply: fournissez un fichier de disposition, `-` pour stdin, ou --from-saved <nom> %1$@
ja: vm layout apply: レイアウトファイル、標準入力を使う場合は `-`、または --from-saved <name> を指定してください %1$@
ko: vm layout apply: 레이아웃 파일을 지정하거나, 표준 입력(stdin)을 위한 `-` 또는 --from-saved <name>을 지정하십시오 %1$@
zh_hans: vm layout apply: 请提供布局文件、使用 `-` 表示 stdin，或指定 --from-saved <name> %1$@
zh_hant: vm layout apply: 請提供版面配置檔案、以 `-` 代表 stdin，或使用 --from-saved <name> %1$@

# cli.vm.layout.applyInvalidLayoutDocument
source: vm layout apply: invalid layout document: %1$@
ar: vm layout apply: مستند تخطيط غير صالح: %1$@
de: vm layout apply: ungültiges Layout-Dokument: %1$@
es: vm layout apply: documento de diseño no válido: %1$@
fr: vm layout apply: document de disposition invalide : %1$@
ja: vm layout apply: レイアウトドキュメントが無効です: %1$@
ko: vm layout apply: 유효하지 않은 레이아웃 문서: %1$@
zh_hans: vm layout apply: 无效的布局文档: %1$@
zh_hant: vm layout apply: 無效的版面配置文件：%1$@

# cli.vm.layout.applyPassAFileOrORFromSaved
source: vm layout apply: pass a file (or -) OR --from-saved <name>, not both %1$@
ar: vm layout apply: مرر ملفًا (أو -) أو --from-saved <name>، وليس كلاهما %1$@
de: vm layout apply: eine Datei (oder -) ODER --from-saved <name> übergeben, nicht beides %1$@
es: vm layout apply: proporcione un archivo (o -) O --from-saved <name>, no ambos %1$@
fr: vm layout apply: indiquez un fichier (ou -) OU --from-saved <name>, mais pas les deux %1$@
ja: vm layout apply: ファイル（または -）または --from-saved <name> のいずれか一方のみを指定してください。両方は指定できません %1$@
ko: vm layout apply: 파일(또는 -) 또는 --from-saved <name> 중 하나만 전달해야 하며, 둘 다 전달할 수는 없습니다 %1$@
zh_hans: vm layout apply: 请传入文件 (或 -) 或 --from-saved <name>，不能同时指定两者 %1$@
zh_hant: vm layout apply: 請傳遞檔案 (或 -) 或 --from-saved <name>，不能同時指定兩者 %1$@

# cli.vm.layout.applySavedLayoutCouldNotBeEncoded
source: vm layout apply: saved layout %1$@ could not be encoded
ar: vm layout apply: تعذر ترميز التخطيط المحفوظ %1$@
de: vm layout apply: Gespeichertes Layout %1$@ konnte nicht kodiert werden
es: vm layout apply: el diseño guardado %1$@ no se pudo codificar
fr: vm layout apply: la disposition sauvegardée %1$@ n'a pas pu être encodée
ja: vm layout apply: 保存されたレイアウト %1$@ をエンコードできませんでした
ko: vm layout apply: 저장된 레이아웃 %1$@을(를) 인코딩할 수 없습니다
zh_hans: vm layout apply: 已保存的布局 %1$@ 无法进行编码
zh_hant: vm layout apply: 無法編碼已儲存的版面配置 %1$@
